{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.9.0",
  "convertedBy": "TensorFlow.js",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "batch_input_shape": [1, 7],
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.7.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [7, 64],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [64, 1],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ],
  "weightSpecs": [
    {
      "name": "dense/kernel",
      "shape": [3, 64],
      "dtype": "float32"
    },
    {
      "name": "dense/bias",
      "shape": [64],
      "dtype": "float32"
    },
    {
      "name": "dense_1/kernel",
      "shape": [64, 1],
      "dtype": "float32"
    },
    {
      "name": "dense_1/bias",
      "shape": [1],
      "dtype": "float32"
    }
  ],
  "formatVersion": 1
}
